import React, { Component } from 'react';
import {
	Platform,
	BackAndroid,
	Linking,
	Dimensions,
	AsyncStorage,
	View,
	ScrollView,
	Text,
	Alert,
	Image,
	StatusBar,
	Animated,
	TextInput,
	TouchableHighlight,
	TouchableOpacity,
} from 'react-native';
import Icon from 'react-native-vector-icons/MaterialIcons';

import variables from './../theme/variables.js';
import styles from './../theme/styles.js';
import t from './../Translations';

//Правила користування та захисту інформації

export default class PasswordReset extends Component {

	constructor(props) {
		super(props);
		this.state = {
			email: '',
			phone: ''
		};
	};

	navigate(routeName, routeData) {
		this.props.navigator.push({
			name: routeName,
			data: routeData
		});
	}

	render() {
		return (
			<View style={styles.scene}>
				<View style={[styles.header, styles.shadow]}>
					<View style={styles.headerLeft}>
						<TouchableOpacity
							style={styles.btn}
							onPress={() => this.props.navigator.pop()}>
							<Icon style={[styles.btnIcon, styles.textSM, styles.primary]} size={20} name="arrow-back"/>
							<Text style={[styles.textSM, styles.primary]}>{t.back}</Text>
						</TouchableOpacity>
					</View>
					<View style={styles.headerCenter}>
						<Image
							style={[ styles.logoHeader ]}
							source={require('./../images/logo-header.png')}
						/>
					</View>
					<View style={styles.headerRight}>
					</View>
				</View>

				<ScrollView style={styles.scroll}>

					<View style={styles.container}>
						<View style={styles.center}>
							<Text style={[styles.textMD, styles.primary, styles.textCenter]}>Правила користування та захисту інформації</Text>
							<View style={styles.hr} />
						</View>

						<Text>1. Статус Правил</Text>
						<Text>1.1. Ці Правила являють собою угоду між Розробником і Користувачем (далі «Сторони») та регулюють права і обов{"'"}язки Розробника та Користувача у зв{"'"}язку з використанням Додатку.</Text>
						<Text>1.2. Ці Правила є офіційним типовим документом Розробників. Ці Правила застосовуються до вказаних відносин у випадку, якщо Розробник не затвердив і не застосовує свої власні Правила надання послуг.</Text>

						<Text>2. Права та обов{"'"}язки Сторін</Text>
						<Text>2.1. Користувач зобов{"'"}язаний ознайомитися з інформацією про Розробника, політикою конфіденційності Розробника і справжніми Правилами. При незгоді з положеннями зазначених документів Користувач зобов{"'"}язаний утриматися від запуску і використання Додатку.</Text>
						<Text>2.2. Забороняється пропонувати послуги, пов{"'"}язані з використанням Додатку, іншим Користувачам в цілях витягання прибутку. Забороняється використання будь-яких автоматичних скриптів («програми-роботи») чи інших засобів, що дозволяють взаємодіяти з Додатком без участі Користувача. Забороняється вчиняти дії, спрямовані на порушення нормального функціонування Додатку, та використовувати спеціальні програми, що містять шкідливі компоненти (віруси).</Text>
						<Text>2.3. Розробник має право запитувати і використовувати інформацію про Користувача виключно в цілях надання послуг по використанню Додатку. Використання інформації про Користувача регулюється політикою конфіденційності Розробника.</Text>
						<Text>2.4. Розробник зобов{"'"}язаний забезпечити технічну підтримку Додатку та надати простий спосіб зв{"'"}язку для звернень Користувачів з усіх виникаючих у процесі використання Додатку питань.</Text>
						<Text>2.5. Користувач не має права передавати інформацію про Додаток третій стороні.</Text>
						<Text>2.6. Розробник не несе відповідальності за неправильне використання Додатку Користувачем або іншими особами.</Text>

						<Text>3. Інтелектуальна власність</Text>
						<Text>3.1. Користувач визнає, що Додаток, його інтерфейс і зміст (включаючи, але не обмежуючись, елементи дизайну, текст, графічні зображення, ілюстрації, відео, скрипти, програми, музика, звуки та інші об{"'"}єкти та їх збірки, пов{"'"}язані з Додатком) захищені авторським правом, товарними знаками, патентами та іншими правами, які належать законним правовласникам.</Text>
						<Text>3.2. Користувач не має права відтворювати, копіювати, змінювати, знищувати, переробляти (включаючи виконання будь-якого перекладу або локалізації), продавати, здавати в прокат, опубліковувати, завантажувати, іншим чином поширювати Додаток або його компоненти,або іншим чином намагатися отримати вихідний код компонентів Додатку, а також змінювати функціонал Додатку.</Text>
						<Text>3.3. Користувач не має права видаляти і/або змінювати будь-яку інформацію, розміщену в рамках Додатку, в тому числі знаки охорони авторського права.</Text>

						<Text>4. Гарантії та Відповідальність</Text>
						<Text>4.1. Розробник не надає гарантій щодо наслідків використання Додатку, взаємодії Додатку з іншим програмним забезпеченням.</Text>
						<Text>4.2. Розробник або інші правовласники ні за яких обставин не несуть відповідальність за будь-який непрямий, випадковий, ненавмисний збиток (включаючи упущену вигоду, збиток, заподіяний втратою даних), викликаний у зв{"'"}язку з використанням Додатку або неможливістю його використання, в тому числі у разі відмови роботи Додатку.</Text>
						<Text>4.3. Користувач самостійно несе відповідальність за свої дії по використанню Додатку, в тому числі за дії по розміщенню і передачі інформації та інших матеріалів іншим Користувачам за допомогою Додатку. Користувач самостійно несе відповідальність за дотримання прав третіх осіб, чинного законодавства, цих Правил, будь-яких правил та/або обов{"'"}язкових інструкцій Розробника.</Text>

						<Text>5. Заключні положення</Text>
						<Text>5.1. Користувач має право у будь-який момент відмовитися від надання послуг за допомогою видалення Додатку.</Text>
						<Text>5.2. У разі виникнення будь-яких суперечок або розбіжностей, пов{"'"}язаних з виконанням цих Правил, Розробник і Користувач прикладуть усі зусилля для їх вирішення шляхом проведення переговорів між ними.</Text>
						<Text>5.3. Ці Правила складені українською мовою і можуть бути надані Користувачеві для ознайомлення іншою мовою. У разі розбіжності україномовної версії Правил і Правил іншою мовою, застосовуються положення україномовної версії цих Правил.</Text>

					</View>

				</ScrollView>

			</View>
		);
	}


};
