import LocalizedStrings from 'react-native-localization';

var data = {};

data.ru = {
	positions: [
		"Старший региональный представитель",
		"Региональный представитель"
	],
	certificates: [
		"Rozetka",
		"WOG",
		"Сильпо"
	],
	regions: [
		"Киевская, Черниговская, Черкасская (вост без г.Умань)",
		"Житомирская, Винницкая., Черкасская (зап от г.Умань)",
		"Одесская, Республика Молдова",
		"Львовская, Закарпатская",
		"Волынская, Ровенская, Хмельницкая",
		"Тернопольская, Ивано-Франковская, Черновецкая",
		"Сумская, Полтавская, Харьковская, Луганская",
		"Днепр. (без г.Кривой Рог), Донецкая, Запорожская",
		"Кировогр., Николаевская, Херсонская, Днепр. (г.Кривой Рог)"
	],
	days: [
		'пн',
		'вт',
		'ср',
		'чт',
		'пт',
		'сб',
		'вс'
	],
	months: [
		"Январь",
		"Февраль",
		"Март",
		"Апрель",
		"Май",
		"Июнь",
		"Июль",
		"Август",
		"Сентябрь",
		"Октябрь",
		"Листопад",
		"Декабрь"
	]
};

data.uk = {
	positions: [
		"Старший регіональний представник",
		"Регіональний представник"
	],
	certificates: [
		"Rozetka",
		"WOG",
		"Сільпо"
	],
	regions: [
		"Київська, Чернігівська, Черкаська (вост без г.Умань)",
		"Житомирська, Вінницька., Черкаська (зап от г.Умань)",
		"Одеська, Республіка Молдова",
		"Львівська, Закарпатська",
		"Волинська, Рівненська, Хмельницька",
		"Тернопільська, Івано-Франківська, Чернівецька",
		"Сумська, Полтавська, Харківська, Луганська",
		"Дніпр. (без г.Кривой Рог), Донецька, Запорізька",
		"Кіровогр., Миколаївська, Херсонська, Дніпр. (г.Кривой Рог)"
	],
	days: [
		'пн',
		'вт',
		'ср',
		'чт',
		'пт',
		'сб',
		'нд'
	],
	months: [
		"Січень",
		"Лютий",
		"Березень",
		"Квітень",
		"Травень",
		"Червень",
		"Липень",
		"Серпень",
		"Вересень",
		"Жовтень",
		"Листопад",
		"Грудень"
	]
};

data.en = data.ru;

export default new LocalizedStrings(data);
