import LocalizedStrings from 'react-native-localization';

export default new LocalizedStrings({
	en:{
		regions: [
			"Київ",
			"Вінницька область",
			"Волинська область",
			"Дніпропетровська область",
			"Донецька область",
			"Житомирська область",
			"Закарпатська область",
			"Запорізька область",
			"Івано-Франківська область",
			"Київська область",
			"Кіровоградська область",
			"Луганська область",
			"Львівська область",
			"Миколаївська область",
			"Одеська область",
			"Полтавська область",
			"Рівненська область",
			"Сумська область",
			"Тернопільська область",
			"Харківська область",
			"Херсонська область",
			"Хмельницька область",
			"Черкаська область",
			"Чернівецька область",
			"Чернігівська область"
		],
		days: [
			'mon',
			'tue',
			'wed',
			'thu',
			'fri',
			'sat',
			'sun'
		]
	},
	ru: {
		regions: [
			"Київ",
			"Вінницька область",
			"Волинська область",
			"Дніпропетровська область",
			"Донецька область",
			"Житомирська область",
			"Закарпатська область",
			"Запорізька область",
			"Івано-Франківська область",
			"Київська область",
			"Кіровоградська область",
			"Луганська область",
			"Львівська область",
			"Миколаївська область",
			"Одеська область",
			"Полтавська область",
			"Рівненська область",
			"Сумська область",
			"Тернопільська область",
			"Харківська область",
			"Херсонська область",
			"Хмельницька область",
			"Черкаська область",
			"Чернівецька область",
			"Чернігівська область"
		],
		days: [
			'пн',
			'вт',
			'ср',
			'чт',
			'пт',
			'сб',
			'вс'
		]
	},
	uk: {
		regions: [
			"Київ",
			"Вінницька область",
			"Волинська область",
			"Дніпропетровська область",
			"Донецька область",
			"Житомирська область",
			"Закарпатська область",
			"Запорізька область",
			"Івано-Франківська область",
			"Київська область",
			"Кіровоградська область",
			"Луганська область",
			"Львівська область",
			"Миколаївська область",
			"Одеська область",
			"Полтавська область",
			"Рівненська область",
			"Сумська область",
			"Тернопільська область",
			"Харківська область",
			"Херсонська область",
			"Хмельницька область",
			"Черкаська область",
			"Чернівецька область",
			"Чернігівська область"
		],
		days: [
			'пн',
			'вт',
			'ср',
			'чт',
			'пт',
			'сб',
			'нд'
		]
	}
});
