import LocalizedStrings from "react-native-localization";

var translations = {};

translations.ru = {
	lng: 'ru',
	allTime: "За все время",
	bonuses: "Бонусы",
	summ: "Сумма",
	copyright: "2017 JayaDigital. All rights reserved.",
	describeTheProblem: "Максимально подробно опишите возникшую проблему",
	errorUserNotFound: "Пользователя не найдено",
	helpToImproveApp: "Помогите нам улучшить приложение",
	loginError: "E-mail или пароль неверны!",
	month: "Месяц",
	regRulesAgreement_1: "Регистрируясь в Retail Club, вы принимаете",
	regRulesAgreement_2: "Правила пользования и зашиты информации",
	registrationDate: "Дата регистрации",
	regDate: "Дата рег.",


	title: {
		about: "О приложении",
		editProfile: "Редактировать профиль",
		feedback: "Отправить отзыв или предложение",
		login: "Войти",
		passwordRecovery: "Восстановление пароля",
		reportAnError: "Сообщить об ошибке",
		rules: "Правила пользования и защиты информации",
		sellerBase: "База продавцов-участников программы",
		techSupport: "Техническая поддержка",
		byMonth: "Бонусы по месяцам"
	},

	logo: {
		member: "представителя",
		regional: "регионального",
		registration: "Регистрация",
		seller: "торгового",
	},

	form: {
		email: "E-mail",
		enterYourEmail: "Введите Ваш E-mail адрес",
		desiredCertificate: "Желаемый сертификат",
		loginData: "данные для входа",
		comment: "Комментарий",
		message: "Сообщение",
		middleName: "Отчество",
		name: "Имя",
		newPassword: "Новый пароль",
		oldPassword: "Старый пароль",
		password: "Пароль",
		passwordEdit: "Изменение пароля",
		passwordConfirm: "Подтвердите пароль",
		phone: "Телефон",
		phoneNumber: "Номер телефона",
		position: "Должность",
		region: "Регион",
		requiredFields: "Поля обязательны к заполнению",
		selectLanguage: "Выбор языка интерфейса",
		subject: "Тема письма",
		surname: "Фамилия",
		tradePoint: "Торговая точка",
	},

	btn: {
		about: "О приложении",
		back: "Назад",
		forgotPassword: "забыли пароль?",
		change: "Изменить",
		logout: "Выйти из учетной записи",
		registration: "зарегистрироваться",
		reportAnError: "Сообщить об ошибке",
		save: "Сохранить",
		submit: "Отправить",
		submitFeedback: "отправляйте отзывы или предложения",

		disabled: "недоступно",
		pay: "выплатить",
		paid: "выплачено",
	},

	error: {
		error: "Ошибка",
		email: "Неверный формат E-mail",
		empty: "Заполните обязательные поля",
		password: "Пароль должен состоять минимум из 6 символов",
		passwordConfirm: "Пароли не совпадают",
		phone: "Номер телефона должен состоять из 12 символов",
		emailUsed: "Этот E-mail уже используется",
		serverError: "Ошибка сервера",
		offline: "Проверьте подключение интернету",
		month: "Выплата бонусов еще не доступна. Выбранный месяц не закончился."
	},

	message: {
		done: "Готово!",
		dataUpdated: "Ваши данные обновлены",
		dataSent: "Ваши данные отправлены на валидацию",
		messageSent: "Ваше сообщение отправлено!",
		passwordResetSuccess: "На Ваш почтовый ящик отправлено письмо с новым паролем!",
		success: "" ,
		confirmAction: "Подтвердите операцию",
		payConfirm: "Вы подтверждаете списание бонусов за",
		yes: "Да",
		no: "Нет",
		login: "Проверьте Ваш E-mail и пароль",
		errorCode: "Код ошибки",
		errorDescription: "Текст ошибки"
	},

	menu: {
		root: "Домой",
		statistics: "Статистика",
		sellerRegistration: "Анкета продавца",
		settings: "Настройки",
		support: "Сообщить о проблеме",
	},

	main: {
		title1: "Презентация программы мотивации",
		description1: "В данном разделе региональный представитель может кратко презентовать условия программы новому участнику",
		title2: "Регистрация продавца",
		description2: "В данном разделе региональный представитель может зарегистрировать нового участника программы Retail Club",
		title3: "Статистика",
		description3: "В данном разделе содержится детальная информация о всех зарегистрированных участниках программы Retail Club",
		title4: "Техническая поддержка",
		description4: ""
	},

	presentation: {
		title1: "Продажа",
		description1: "За каждую проданную единицу со специальным кодом продавец получает бонусное вознаграждение",
		title2: "Отправка SMS",
		description2: "Продавец осуществляет продажи и отправляет SMS c индивидуальным кодом упаковки на специальный номер Rovese",
		title3: "Бонусы",
		description3: "Все бонусы суммируются на протяжении установленного периода и в конце каждый продавец получает сертификат на сумму бонусов"
	},

	rules: {
		t1: "Статус Правил",
		p11: "Настоящие Правила представляют собой соглашение между Разработчиком и Пользователем (далее вместе именуемые «Стороны») и регулируют права и обязанности Разработчика и Пользователя в связи с использованием Приложения.",
		p12: "Настоящие Правила являются официальным типовым документом Разработчиков. Настоящие Правила применяются к указанным отношениям в случае, если Разработчик не утвердил и не применяет свои собственные Правила оказания услуг.",
		t2: "Права и обязанности Сторон",
		p21: "Пользователь обязан ознакомиться с информацией о Разработчике, политикой конфиденциальности Разработчика и настоящими Правилами. При несогласии с положениями указанных документов Пользователь обязан воздержаться от запуска и использования Приложения.",
		p22: "Запрещается предлагать услуги, связанные с использованием Приложения, другим Пользователям в целях извлечения прибыли. Запрещается использование каких-либо автоматических скриптов («программы-роботы») или иных средств, позволяющих взаимодействовать с Приложением без участия Пользователя. Запрещается совершать действия, направленные на нарушение нормального функционирования Приложения, и использовать специальные программы, содержащие вредоносные компоненты («вирусы»).",
		p23: "Разработчик вправе запросить и использовать информацию о Пользователе исключительно в целях предоставления услуг по использованию Приложения. Использование информации о Пользователе регулируется политикой конфиденциальности Разработчика.",
		p24: "Разработчик обязан обеспечить техническую поддержку Приложения и предоставить простой способ связи для обращений Пользователей по всем возникающим в процессе использования Приложения вопросам.",
		p25: "Пользователь не имеет права передавать информацию о Приложении третей стороне.",
		p26: "Разработчик не несет ответственности за неправильное использование Приложения Пользователем или другими лицами.",
		t3: "Интеллектуальная собственность",
		p31: "Пользователь признает, что Приложение, его интерфейс и содержание (включая, но не ограничиваясь, элементы дизайна, текст, графические изображения, иллюстрации, видео, скрипты, программы, музыка, звуки и другие объекты и их подборки, связанные с Приложением) защищены авторским правом, товарными знаками, патентами и иными правами, которые принадлежат законным правообладателям.",
		p32: "Пользователь не вправе воспроизводить, копировать, изменять, уничтожать, перерабатывать (включая выполнение любого перевода или локализации), продавать, сдавать в прокат, опубликовывать, скачивать, иным образом распространять Приложение либо его компоненты, декомпилировать или иным образом пытаться извлечь исходный код компонентов Приложения, являющихся программным обеспечением, а также изменять функционал Приложения.",
		p33: "Пользователь не вправе удалять и/или изменять какую-либо информацию, размещенную в рамках Приложения, в том числе знаки охраны авторского права и средств индивидуализации.",
		t4: "Гарантии и Ответственность",
		p41: "Пользователь признает и соглашается с тем, что Приложение предоставляется на условиях «как есть». Разработчик не предоставляет гарантий в отношении последствий использования Приложения, взаимодействия Приложения с другим программным обеспечением.",
		p42: "Разработчик или иные правообладатели ни при каких обстоятельствах не несут ответственность за любой косвенный, случайный, неумышленный ущерб (включая упущенную выгоду, ущерб, причиненный утратой данных), вызванный в связи с использованием Приложения или невозможностью его использования, в том числе в случае отказа работы Приложения или иного перерыва в использовании Приложения.",
		p43: "Пользователь самостоятельно несет ответственность за свои действия по использованию Приложения, в том числе за действия по размещению и передаче информации и иных материалов другим Пользователям с помощью Приложения. Пользователь самостоятельно несет ответственность за соблюдение прав третьих лиц, применимого законодательства, настоящих Правил, каких-либо правил и/или обязательных инструкций Разработчика.",
		t5: "Заключительные положения",
		p51: "Пользователь вправе в любой момент отказаться от предоставления услуг посредством удаления Приложения.",
		p52: "В случае возникновения любых споров или разногласий, связанных с исполнением настоящих Правил, Разработчик и Пользователь приложат все усилия для их разрешения путем проведения переговоров между ними.",
		p53: "Настоящие Правила составлены на русском языке и могут быть предоставлены Пользователю для ознакомления на другом языке. В случае расхождения русскоязычной версии Правил и версии Правил на ином языке, применяются положения русскоязычной версии настоящих Правил."
	}
};

translations.uk = {
	lng: 'uk',
	allTime: "За весь час",
	bonuses: "Бонуси",
	summ: "Сума",
	copyright: "2017 JayaDigital. All rights reserved.",
	describeTheProblem: "Максимально докладно опишіть виниклу проблему",
	errorUserNotFound: "Користувача, не знайдено",
	helpToImproveApp: "Допоможіть нам поліпшити додаток",
	loginError: "E-mail або пароль невірні!",
	month: "Місяць",
	regRulesAgreement_1: "Реєструючись в Retail Club, ви приймаєте",
	regRulesAgreement_2: "Правила користування і захисту інформації",
	registrationDate: "Дата реєстрації",
	regDate: "Дата реєстр.",

	title: {
		about: "Про програму",
		editProfile: "Редагувати профіль",
		feedback: "відгук або пропозицію",
		login: "Увійти",
		passwordRecovery: "Відновлення пароля",
		reportAnError: "Повідомити про помилку",
		rules: "Правила Користування та захисту інформації",
		sellerBase: "База продавців-учасників програми",
		techSupport: "Технічна підтримка",
		byMonth: "Бонуси по місяцям",
	},

	logo: {
		member: "представника",
		regional: "регіонального",
		registration: "Реєстрація",
		seller: "торгового",
	},

	form: {
		email: "E-mail",
		enterYourEmail: "Введіть Вашу E-mail адресу",
		desiredCertificate: "Бажаний сертифікат",
		loginData: "дані для входу",
		comment: "Коментар",
		message: "Повідомлення",
		middleName: "По батькові",
		name: "Ім'я",
		newPassword: "Новий пароль",
		oldPassword: "Старий пароль",
		password: "Пароль",
		passwordEdit: "Зміна пароля",
		passwordConfirm: "Підтвердіть пароль",
		phone: "Телефон",
		phoneNumber: "Номер телефону",
		position: "Посада",
		region: "Регіон",
		requiredFields: "Поля обов'язкові до заповнення",
		selectLanguage: "Вибір мови інтерфейсу",
		subject: "Тема листа",
		surname: "Прізвище",
		tradePoint: "Торгова точка",
	},

	btn: {
		about: "Про програму",
		back: "Назад",
		forgotPassword: "забули пароль?",
		change: "Змінити",
		logout: "Вийти з облікового запису",
		registration: "зареєструватися",
		reportAnError: "Повідомити про помилку",
		save: "Зберегти",
		submit: "Відправити",
		submitFeedback: "відправляйте відгуки або пропозиції",

		disabled: "недоступно",
		pay: "виплатити",
		paid: "виплачено",
	},

	error: {
		error: "Помилка",
		email: "Неправильний формат E-mail",
		empty: "Заповніть обов'язкові поля",
		password: "Пароль повинен містити мінімум 6 символів",
		passwordConfirm: "Паролі не збігаються",
		phone: "Номер телефона повинен містити 12 символів",
		serverError: "Помилка сервера",
		emailUsed: "Цей E-mail уже використовується",
		offline: "Перевірте інтернет з`єднання",
		month: "Виплата бонусів ще не доступна. Вибраний місяць не закінчився."
	},

	message: {
		done: "Готово!",
		dataUpdated: "Ваші дані оновлені",
		dataSent: "Ваші дані відправлені на валідацію",
		messageSent: "Ваше повідомлення надіслано!",
		passwordResetSuccess: "На Вашу поштову скриньку відправлено лист з новим паролем!",
		success: "",
		confirmAction: "Підтвердіть операцію",
		payConfirm: "Ви підтверджуєте списання бонусів за",
		yes: "Так",
		no: "Ні",
		login: "Перевірте Ваш E-mail и пароль",
		errorCode: "Код ошибки",
		errorDescription: "Текст помилки"
	},

	menu: {
		root: "Додому",
		statistics: "Статистика",
		sellerRegistration: "Анкета продавця",
		settings: "Налаштування",
		support: "Повідомити про проблему",
	},

	main: {
		title1: "Презентація програми мотивації",
		description1: "В даному розділі регіональний представник може коротко презентувати умови програми новому учаснику",
		title2: "Реєстрація продавця",
		description2: "В даному розділі регіональний представник може зареєструвати нового учасника програми Retail Club",
		title3: "Статистика",
		description3: "В даному розділі міститься детальна інформація про всіх зареєстрованих учасників програми Retail Club",
		title4: "Технічна підтримка",
		description4: ""
	},

	presentation: {
		title1: "Продаж",
		description1: "За кожну продану одиницю зі спеціальним кодом продавець отримує бонусну винагороду",
		title2: "Відправка SMS",
		description2: "Продавець здійснює продажу і відправляє SMS з індивідуальним кодом упаковки на спеціальний номер Rovese",
		title3: "Бонуси",
		description3: "Всі бонуси сумуються протягом встановленого періоду і в кінці кожен продавець отримує сертифікат на суму бонусів"
	},

	rules: {
		t1: "Статус Правил",
		p11: "Ці Правила являють собою угоду між Розробником і Користувачем (далі «Сторони») та регулюють права і обов'язки Розробника та Користувача у зв'язку з використанням Додатку.",
		p12: "Ці Правила є офіційним типовим документом Розробників. Ці Правила застосовуються до вказаних відносин у випадку, якщо Розробник не затвердив і не застосовує свої власні Правила надання послуг.",
		t2: "Права та обов'язки Сторін",
		p21: "Користувач зобов'язаний ознайомитися з інформацією про Розробника, політикою конфіденційності Розробника і справжніми Правилами. При незгоді з положеннями зазначених документів Користувач зобов'язаний утриматися від запуску і використання Додатку.",
		p22: "Забороняється пропонувати послуги, пов'язані з використанням Додатку, іншим Користувачам в цілях витягання прибутку. Забороняється використання будь-яких автоматичних скриптів («програми-роботи») чи інших засобів, що дозволяють взаємодіяти з Додатком без участі Користувача. Забороняється вчиняти дії, спрямовані на порушення нормального функціонування Додатку, та використовувати спеціальні програми, що містять шкідливі компоненти (віруси).",
		p23: "Розробник має право запитувати і використовувати інформацію про Користувача виключно в цілях надання послуг по використанню Додатку. Використання інформації про Користувача регулюється політикою конфіденційності Розробника.",
		p24: "Розробник зобов'язаний забезпечити технічну підтримку Додатку та надати простий спосіб зв'язку для звернень Користувачів з усіх виникаючих у процесі використання Додатку питань.",
		p25: "Користувач не має права передавати інформацію про Додаток третій стороні.",
		p26: "Розробник не несе відповідальності за неправильне використання Додатку Користувачем або іншими особами.",
		t3: "Інтелектуальна власність",
		p31: "Користувач визнає, що Додаток, його інтерфейс і зміст (включаючи, але не обмежуючись, елементи дизайну, текст, графічні зображення, ілюстрації, відео, скрипти, програми, музика, звуки та інші об'єкти та їх збірки, пов'язані з Додатком) захищені авторським правом, товарними знаками, патентами та іншими правами, які належать законним правовласникам.",
		p32: "Користувач не має права відтворювати, копіювати, змінювати, знищувати, переробляти (включаючи виконання будь-якого перекладу або локалізації), продавати, здавати в прокат, опубліковувати, завантажувати, іншим чином поширювати Додаток або його компоненти,або іншим чином намагатися отримати вихідний код компонентів Додатку, а також змінювати функціонал Додатку.",
		p33: "Користувач не має права видаляти і/або змінювати будь-яку інформацію, розміщену в рамках Додатку, в тому числі знаки охорони авторського права.",
		t4: "Гарантії та Відповідальність",
		p41: "Розробник не надає гарантій щодо наслідків використання Додатку, взаємодії Додатку з іншим програмним забезпеченням.",
		p42: "Розробник або інші правовласники ні за яких обставин не несуть відповідальність за будь-який непрямий, випадковий, ненавмисний збиток (включаючи упущену вигоду, збиток, заподіяний втратою даних), викликаний у зв'язку з використанням Додатку або неможливістю його використання, в тому числі у разі відмови роботи Додатку.",
		p43: "Користувач самостійно несе відповідальність за свої дії по використанню Додатку, в тому числі за дії по розміщенню і передачі інформації та інших матеріалів іншим Користувачам за допомогою Додатку. Користувач самостійно несе відповідальність за дотримання прав третіх осіб, чинного законодавства, цих Правил, будь-яких правил та/або обов'язкових інструкцій Розробника.",
		t5: "Заключні положення",
		p51: "Користувач має право у будь-який момент відмовитися від надання послуг за допомогою видалення Додатку.",
		p52: "У разі виникнення будь-яких суперечок або розбіжностей, пов'язаних з виконанням цих Правил, Розробник і Користувач прикладуть усі зусилля для їх вирішення шляхом проведення переговорів між ними.",
		p53: "Ці Правила складені українською мовою і можуть бути надані Користувачеві для ознайомлення іншою мовою. У разі розбіжності україномовної версії Правил і Правил іншою мовою, застосовуються положення україномовної версії цих Правил."
	}
};

translations.en = translations.ru;

// var language = 'ru';

// async function getLang(){
//     try{
//         language = await AsyncStorage.getItem('language');
//         return language;
//     }
//     catch(error){
//         // Handle exceptions
//     }
// }

// export default translations[language];

export default new LocalizedStrings(translations);
